//小玉家今天收到了一份电费通知单。小玉看到上面写：据闽价电[2006]27号规定，
//月用电量在150千瓦时及以下部分按每千瓦时0.4463元执行，
//月用电量在151~400千瓦时的部分按每千瓦时0.4663元执行，
//月用电量在401千瓦时及以上部分按每千瓦时0.5663元执行;
//小玉想自己验证一下，电费通知单上应交电费的数目到底是否正确呢。
//请编写一个程序，已知用电总计，根据电价规定，计算出应交的电费应该是多少。
#define  _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>

int main() {
	int num;
	scanf("%d", &num);
	double s;
	if (num <= 150) {
		s = num * 0.4463;
	}
	else if (num > 150 && num <= 400) {
		s = 150 * 0.4463 + (num - 150) * 0.4663;
	}
	else if (num > 400) {
		s = 150 * 0.4663 + 250 * 0.4663 + (num - 400) * 0.5663;
	}
	printf("%0.1f", s);
	system("pause");
	return 0;
}